<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:22px;text-align:center">Семинар 4.1. Подзапросы</p> 

<a id = Home></a>

17 марта 2022 года, пн<br>
Поток: ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (2 подгруппа)<br>


21 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (3 подгруппа)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (4 подгруппа)<br>

31 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (1 подгруппа)


```
STUDENT
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.


LECTURER
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель


SUBJECT
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.


UNIVERSITY
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.


EXAM_MARKS
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.


SUBJ_LECT
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.
```

<img src="../Img/Students_Schema.png" style="width:60%">

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания в Jupyter Notebook</p>

1. С помощью подзапроса напишите запрос, выводящий список студентов, получающих максимальную стипендию, отсортировав его в алфавитном порядке по фамилиям.
2. С помощью подзапроса напишите запрос, выводящий список студентов, получающих стипендию, превышающую среднее значение стипендии.
3. С помощью подзапроса напишите запрос, выводящий список студентов, обучающихся в Воронеже, с последующей сортировкой по идентификаторам университетов и курсам.
4. С помощью подзапроса напишите запрос, выводящий список предметов, на изучение которых отведено максимальное количество часов.
5. Напишите запрос, выполняющий вывод имен и фамилий студентов, место проживания которых не совпадает с городом, в котором находится их университет.
6. С помощью подзапроса напишите запрос, выводящий список университетов, расположенных в Москве и имеющих рейтинг больший, чем у ВГУ.

In [1]:
#! pip install sqlalchemy

In [2]:
import pandas as pd
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_
from sqlalchemy.sql import func

In [13]:
engine = create_engine('sqlite:///Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД
# Вызов метода reflect() приводит к включению в объект metadata_obj словаря всех таблиц БД.

Несколько примеров получения информации о БД с помощью методов объекта ***metadata_obj***.

In [9]:
# Таблицы в БД
metadata_obj.tables.keys()

dict_keys(['city', 'exam_marks', 'student', 'university', 'subject', 'lecturer', 'subj_lect'])

In [5]:
# Имя конкретной таблицы
metadata_obj.tables['student'].name

'student'

In [6]:
# Столбцы конкретной таблицы
metadata_obj.tables['student'].columns.keys()

['student_id',
 'surname',
 'name',
 'stipend',
 'kurs',
 'city',
 'birthday',
 'univ_id']

In [7]:
# Информация о столбце
metadata_obj.tables['student'].columns['student_id']

Column('student_id', INTEGER(), table=<student>, primary_key=True, nullable=False)

In [12]:
for t in metadata_obj.sorted_tables:
    print(t.name)

city
subject
university
lecturer
student
exam_marks
subj_lect

In [13]:
for t in metadata_obj.sorted_tables:
    print(t.name)
    for c in t.columns:
        print(c)
    print()

city
city.city_id
city.name

subject
subject.subj_id
subject.subj_name
subject.hour
subject.semester

university
university.univ_id
university.univ_name
university.rating
university.city

lecturer
lecturer.lecturer_id
lecturer.surname
lecturer.name
lecturer.city
lecturer.univ_id

student
student.student_id
student.surname
student.name
student.stipend
student.kurs
student.city
student.birthday
student.univ_id

exam_marks
exam_marks.exam_id
exam_marks.student_id
exam_marks.subj_id
exam_marks.mark
exam_marks.exam_date

subj_lect
subj_lect.lecturer_id
subj_lect.subj_id

Создание объектов таблиц

In [8]:
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

# Решение

In [9]:
conn=engine.connect() # Соединение

# Ваш код здесь

# №1
# С помощью подзапроса напишите запрос, выводящий список студентов, получающих максимальную стипендию, отсортировав его в алфавитном порядке по фамилиям.

In [10]:
sub_query = select(func.max(student.c.stipend)).scalar_subquery()

s = select(student)
s = s.where(student.c.stipend == sub_query)
s = s.order_by(student.c.surname)

print(s)

pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.stipend = (SELECT max(student.stipend) AS max_1
FROM student) ORDER BY student.surname

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,55,Белкин,Вадим,250,5,Воронеж,2000-01-07,10
1,91,Блохина,Ираида,250,3,Новый Уренгой,1997-03-23,22
2,149,Вячеслав,Пахомов,250,3,Игарка,1997-05-14,14
3,141,Ершов,Митрофан,250,5,Пятигорск,2001-05-28,22
4,64,Жук,Оксана,250,1,Воркута,2000-11-16,47
5,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
6,68,Казакова,Ольга,250,4,Кемерово,2000-03-29,44
7,130,Кудряшов,Роман,250,4,Нижний Новгород,1997-08-26,32
8,92,Мельникова,Светлана,250,4,Кропоткин (Краснод.),1998-03-24,15
9,107,Морозов,Кирилл,250,2,Кропоткин (Краснод.),2000-09-29,44
10,66,Некрасова,Вероника,250,2,Иркутск,2004-08-23,10
11,114,Панов,Арсений,250,1,Геленджик,1996-12-23,32
12,204,Петров,Вадим,250,2,Брянск,2002-05-21,44
13,203,Петрова,Екатерина,250,4,Белгород,2001-05-21,14
14,72,Пономарева,Алина,250,2,Ангарск,2002-10-07,48
15,146,Русаков,Давид,250,2,Байкальск,1998-08-07,47
16,110,Суханов,Константин,250,3,Курск,1996-11-22,14
17,103,Трофимов,Владислав,250,5,Верхоянск,1995-03-24,11


# №2
# С помощью подзапроса напишите запрос, выводящий список студентов, получающих стипендию, превышающую среднее значение стипендии.

In [11]:
sub_query_2 = select(func.avg(student.c.stipend)).scalar_subquery()
s = select(student.c.surname, student.c.name, student.c.stipend, func.date(student.c.birthday))
s = s.where(student.c.stipend > sub_query_2)

pd.read_sql(s, conn)

       surname         name  stipend      date_1
0       Иванов         Иван      150  2002-12-03
1       Петров         Петр      200  2000-12-01
2      Сидоров        Вадим      150  1999-06-07
3      Зайцева        Ольга      250  2001-05-01
4        Котов        Павел      150  2001-02-28
5       Белкин        Вадим      250  2000-01-07
6          Дуб    Елизавета      150  2004-07-04
7          Жук       Оксана      250  2000-11-16
8    Некрасова     Вероника      250  2004-08-23
9     Казакова        Ольга      250  2000-03-29
10    Миронова         Анна      200  2000-10-08
11     Кондрат      Синицин      200  2001-02-23
12  Пономарева        Алина      250  2002-10-07
13      Мишина     Светлана      150  1997-05-22
14    Агафонов      Василий      150  1994-10-29
15      Лапина     Элеонора      150  1997-11-23
16    Сорокина        Ирина      200  1993-09-28
17    Казакова        Мария      150  1994-02-18
18      Жукова        Фекла      150  1998-10-06
19     Жданова        Ирина      200  2002-03-02
20     Валерия  Овчинникова      200  2000-06-15
21     Блохина       Ираида      250  1997-03-23
22  Мельникова     Светлана      250  1998-03-24
23    Сорокина      Валерия      150  1995-03-01
24   Тимофеева        Фаина      150  1999-08-01
25   Вишнякова       Анжела      200  2002-02-10
26    Борисова       Марина      150  1995-08-07
27  Калашников      Евгений      200  1998-02-27
28    Трофимов    Владислав      250  1995-03-24
29     Морозов       Кирилл      250  2000-09-29
30     Назаров        Икром      150  2001-12-15
31     Суханов   Константин      250  1996-11-22
32     Захаров        Софон      150  1994-03-19
33     Аксенов      Валерий      150  1994-10-27
34       Панов      Арсений      250  1996-12-23
35  Кондратьев      Николай      150  1999-10-28
36     Веселов        Тимур      150  1998-04-28
37   Пономарев   Варфоромей      200  2000-12-15
38    Кудряшов        Роман      250  1997-08-26
39     Ковалев         Ефим      200  1995-11-28
40   Жуковский         Юрий      150  1996-05-30
41      Ефимов         Яков      200  2000-09-23
42     Кулаков       Феофан      150  2001-03-14
43    Журавлев         Фома      200  1997-07-12
44      Ширяев       Андрей      150  1997-09-13
45       Ершов     Митрофан      250  2001-05-28
46    Ситников     Викентий      150  2003-10-05
47     Русаков        Давид      250  1998-08-07
48      Гуляев       Кузьма      150  1999-10-13
49    Вячеслав      Пахомов      250  1997-05-14
50     Баранов    Александр      220  2001-08-18
51     Архипов       Андрей      180  2000-01-28
52  Владимиров     Анатолий      200  2003-05-21
53     Петрова    Екатерина      250  2001-05-21
54      Петров        Вадим      250  2002-05-21
55     Иванова        Мария      200  2002-04-11
56     Киселев     Владимир      210  2003-02-10
57    Миронова        Федор      200  2002-04-15
58      Петров        Антон      200  2001-08-05
59       Лукин        Артем      200  2001-12-01

### №3
### С помощью подзапроса напишите запрос, выводящий список студентов, обучающихся в Воронеже, с последующей сортировкой по идентификаторам университетов и курсам.

In [12]:
sub_query_3 = select(university.c.univ_id) # .where(university.c.univ_id == "Воронеж").scalar_subquery()
#sub_query_3 = sub_query_3.where(student.c.univ_id)
sub_query_3 = sub_query_3.where(university.c.city == "Воронеж")


s = select(university)
s = s.where(student.c.univ_id.in_(sub_query_3))
s = s.order_by(university.c.univ_id)

print(s)
pd.read_sql(s, conn)

SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university, student
WHERE student.univ_id IN (SELECT university.univ_id
FROM university
WHERE university.city = :city_1) ORDER BY university.univ_id

/usr/local/lib/python3.9/dist-packages/pandas/io/sql.py:1402: SAWarning: SELECT statement has a cartesian product between FROM element(s) "university" and FROM element "student".  Apply join condition(s) between each element to resolve.
  return self.connectable.execution_options().execute(*args, **kwargs)

     univ_id univ_name  rating       city
0         10       ВГУ   296.0    Воронеж
1         10       ВГУ   296.0    Воронеж
2         10       ВГУ   296.0    Воронеж
3         10       ВГУ   296.0    Воронеж
4         10       ВГУ   296.0    Воронеж
..       ...       ...     ...        ...
294       48      УЛГУ   231.0  Ульяновск
295       48      УЛГУ   231.0  Ульяновск
296       48      УЛГУ   231.0  Ульяновск
297       48      УЛГУ   231.0  Ульяновск
298       48      УЛГУ   231.0  Ульяновск

[299 rows x 4 columns]

### №4
### С помощью подзапроса напишите запрос, выводящий список предметов, на изучение которых отведено максимальное количество часов.

In [44]:
sq = select(university.c.city).scalar_subquery()

s = select(student)
s = s.where(student.c.city != sq)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city != (SELECT university.city
FROM university)

student_id     True
surname        True
name           True
stipend       False
kurs           True
city           True
birthday       True
univ_id        True
dtype: bool

### №5
### Напишите запрос, выполняющий вывод имен и фамилий студентов, место проживания которых не совпадает с городом, в котором находится их университет.

In [14]:
sq = select(university.c.city)
sq = sq.where(university.c.univ_id == student.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.city != sq)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city != (SELECT university.city
FROM university
WHERE university.univ_id = student.univ_id)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,3,Петров,Петр,200,3,Курск,2000-12-01,10
2,10,Кузнецов,Борис,0,2,Брянск,2001-12-08,10
3,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
4,15,Ордуханян,Рафаэль,120,1,Липецк,2003-06-01,18
...,...,...,...,...,...,...,...,...
74,202,Владимиров,Анатолий,200,2,Курск,2003-05-21,14
75,204,Петров,Вадим,250,2,Брянск,2002-05-21,44
76,205,Иванова,Мария,200,1,Липецк,2002-04-11,32
77,206,Киселев,Владимир,210,2,Орел,2003-02-10,44
78,276,Петров,Антон,200,4,Ульяновск,2001-08-05,22

### 6
### С помощью подзапроса напишите запрос, выводящий список университетов, расположенных в Москве и имеющих рейтинг больший, чем у ВГУ.
# ДЗ БД ЧИНУК

# Домашнее задание

1. Выполнить отображение БД Chinook
<img src="../Img/chinook_ERD.png" style="width:100%">



3. Выполнить запросы с помощью подзапросов.

2.1. Составьте запрос, выполняющий вывод информации о счетах клиентов из Бразилии. Результат должен содержать фамилию и имя клиента, идентификатор счета, дату выставления счета, название страны плательщика (Billing Country).

2.2. Покажите сотрудников, подчиняющихся сотруднику *Nancy Edwards*.

2.3. Покажите трэки в жанре *Classical*, длящиеся более 8 минут.

2.4. Покажите альбомы, в составе которых более 25 трэков.

2.5. Покажите жанры, в составе которых имеются трэки, длящиеся более 18 минут.

2.6. Покажите артистов в жанре *Classical*.

2.7. Найдите артистов, записавших альбомы, в которых более 20 произведений.

In [52]:
#1. Выполнить отображение БД Chinook

engine = create_engine('sqlite:///Data/Chinook_Sqlite.sqlite')
metadata_obj = MetaData()
metadata_obj.reflect(bind=engine)

conn=engine.connect() # Соединение

In [53]:
#metadata_obj.tables.keys()
metadata_obj.tables['Customer'].columns.keys()

['CustomerId',
 'FirstName',
 'LastName',
 'Company',
 'Address',
 'City',
 'State',
 'Country',
 'PostalCode',
 'Phone',
 'Fax',
 'Email',
 'SupportRepId']

In [133]:
customer = Table("Customer", metadata_obj, autoload=True, autoload_with="engine")
invoice = Table("Invoice", metadata_obj, autoload=True, autoload_with="engine")
employee = Table("Employee", metadata_obj, autoload=True, autoload_with="engine")
track = Table("Track", metadata_obj, autoload=True, autoload_with="engine")
genre = Table("Genre", metadata_obj, autoload=True, autoload_with="engine")
album = Table("Album", metadata_obj, autoload=True, autoload_with="engine")
artist = Table("Artist", metadata_obj, autoload=True, autoload_with="engine")

In [162]:
#2.1. Составьте запрос, выполняющий вывод информации о счетах клиентов из Бразилии. Результат должен содержать фамилию и имя клиента, идентификатор счета, дату выставления счета, название страны плательщика (Billing Country).
#SQL - SELECT LastName, FirstName, Invoice.InvoiceId, Customer.CustomerId, InvoiceDate, BillingCountry FROM Customer INNER JOIN Invoice ON (Customer.CustomerId = Invoice.CustomerId)  WHERE Customer.Country == "Brazil"

sq = select(customer.c.LastName, customer.c.FirstName, invoice.c.InvoiceId, invoice.c.InvoiceDate,
            invoice.c.BillingCountry, customer.c.Country)
sub_query = select(invoice.c.CustomerId).scalar_subquery()
s = sq.where(customer.c.CustomerId == sub_query, customer.c.Country == "Brazil")

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Customer"."LastName", "Customer"."FirstName", "Invoice"."InvoiceId", "Invoice"."InvoiceDate", "Invoice"."BillingCountry", "Customer"."Country"
FROM "Customer", "Invoice"
WHERE "Customer"."CustomerId" = (SELECT "Invoice"."CustomerId"
FROM "Invoice") AND "Customer"."Country" = :Country_1
Всего записей, удовлетворяющих условию: 412

/usr/local/lib/python3.9/dist-packages/pandas/io/sql.py:1402: SAWarning: SELECT statement has a cartesian product between FROM element(s) "Customer" and FROM element "Invoice".  Apply join condition(s) between each element to resolve.
  return self.connectable.execution_options().execute(*args, **kwargs)

      LastName FirstName  InvoiceId InvoiceDate BillingCountry Country
0    Gonçalves      Luís          1  2009-01-01        Germany  Brazil
1    Gonçalves      Luís          2  2009-01-02         Norway  Brazil
2    Gonçalves      Luís          3  2009-01-03        Belgium  Brazil
3    Gonçalves      Luís          4  2009-01-06         Canada  Brazil
4    Gonçalves      Luís          5  2009-01-11            USA  Brazil
..         ...       ...        ...         ...            ...     ...
407  Gonçalves      Luís        408  2013-12-05            USA  Brazil
408  Gonçalves      Luís        409  2013-12-06         Canada  Brazil
409  Gonçalves      Luís        410  2013-12-09       Portugal  Brazil
410  Gonçalves      Luís        411  2013-12-14        Finland  Brazil
411  Gonçalves      Luís        412  2013-12-22          India  Brazil

[412 rows x 6 columns]

In [87]:
# 2.2. Покажите сотрудников, подчиняющихся сотруднику Nancy Edwards.
# SQL - SELECT * FROM Employee WHERE ReportsTo = (SELECT EmployeeId FROM Employee WHERE LastName = "Edwards" AND FirstName = "Nancy")
sq = select(employee)
sub_query = select(employee.c.EmployeeId).where(employee.c.LastName == "Edwards",
                                                employee.c.FirstName == "Nancy").scalar_subquery()
s = sq.where(employee.c.ReportsTo == sub_query)

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Employee"."EmployeeId", "Employee"."LastName", "Employee"."FirstName", "Employee"."Title", "Employee"."ReportsTo", "Employee"."BirthDate", "Employee"."HireDate", "Employee"."Address", "Employee"."City", "Employee"."State", "Employee"."Country", "Employee"."PostalCode", "Employee"."Phone", "Employee"."Fax", "Employee"."Email"
FROM "Employee"
WHERE "Employee"."ReportsTo" = (SELECT "Employee"."EmployeeId"
FROM "Employee"
WHERE "Employee"."LastName" = :LastName_1 AND "Employee"."FirstName" = :FirstName_1)
Всего записей, удовлетворяющих условию: 3

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29,2002-04-01,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19,2003-05-03,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03,2003-10-17,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [86]:
# 2.3. Покажите трэки в жанре Classical, длящиеся более 8 минут.
# SQL - SELECT * FROM Track WHERE Milliseconds > (1000 * 60 * 8) AND GenreId = (SELECT GenreId FROM Genre WHERE Name = "Classical")
sq = select(track)
sub_query = select(genre.c.GenreId).where(genre.c.Name == "Classical").scalar_subquery()
s = sq.where(track.c.GenreId == sub_query, track.c.Milliseconds > (1000 * 60 * 8))

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Track"."TrackId", "Track"."Name", "Track"."AlbumId", "Track"."MediaTypeId", "Track"."GenreId", "Track"."Composer", "Track"."Milliseconds", "Track"."Bytes", "Track"."UnitPrice"
FROM "Track"
WHERE "Track"."GenreId" = (SELECT "Genre"."GenreId"
FROM "Genre"
WHERE "Genre"."Name" = :Name_1) AND "Track"."Milliseconds" > :Milliseconds_1
Всего записей, удовлетворяющих условию: 11

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,3404,"Miserere mei, Deus",273,2,24,Gregorio Allegri,501503,8285941,0.99
1,3410,"The Messiah: Behold, I Tell You a Mystery... T...",279,2,24,George Frideric Handel,582029,9553140,0.99
2,3423,"Jupiter, the Bringer of Jollity",292,2,24,Gustav Holst,522099,8547876,0.99
3,3425,"Adagio for Strings from the String Quartet, Op...",294,2,24,Samuel Barber,596519,9585597,0.99
4,3432,"Scheherazade, Op. 35: I. The Sea and Sindbad's...",299,2,24,Nikolai Rimsky-Korsakov,545203,8916313,0.99
5,3434,"Concerto for Piano No. 2 in F Minor, Op. 21: I...",301,2,24,Frédéric Chopin,560342,9160082,0.99
6,3440,"Concerto for Cello and Orchestra in E minor, O...",306,2,24,Edward Elgar,483133,7865479,0.99
7,3445,On the Beautiful Blue Danube,311,2,24,Johann Strauss II,526696,8610225,0.99
8,3446,"Symphonie Fantastique, Op. 14: V. Songe d'une ...",312,2,24,Hector Berlioz,561967,9173344,0.99
9,3485,Symphony No. 3 Op. 36 for Orchestra and Sopran...,330,2,24,Henryk Górecki,567494,9273123,0.99
10,3498,"Concerto for Violin, Strings and Continuo in G...",342,4,24,Pietro Antonio Locatelli,493573,16454937,0.99

In [1]:
# 2.4. Покажите альбомы, в составе которых более 25 трэков.
# SQL - SELECT Title, COUNT(Track.AlbumId) FROM Album LEFT JOIN Track on Album.AlbumId = Track.AlbumId GROUP BY Album.AlbumId HAVING COUNT(Track.AlbumId) > 25

s = select(album.c.Title, func.count(track.c.AlbumId).label("Кол-во треков в альбоме")).join(album, album.c.AlbumId == track.c.AlbumId, isouter=True).having(func.count(track.c.AlbumId) > 25)
s = s.group_by(album.c.AlbumId)

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(sub_query, conn)

NameError: name 'select' is not defined

In [132]:
#2.5. Покажите жанры, в составе которых имеются трэки, длящиеся более 18 минут.
# SQL - SELECT * FROM Genre WHERE Genre.GenreId IN (SELECT Track.GenreId FROM Track WHERE Track.Milliseconds > 1000 * 60 * 18)

sq = select(genre)
sub_query = select(track.c.GenreId).where(track.c.Milliseconds > (1000 * 60 * 18))
s = sq.where(genre.c.GenreId.in_(sub_query))

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Genre"."GenreId", "Genre"."Name"
FROM "Genre"
WHERE "Genre"."GenreId" IN (SELECT "Track"."GenreId"
FROM "Track"
WHERE "Track"."Milliseconds" > :Milliseconds_1)
Всего записей, удовлетворяющих условию: 6

   GenreId              Name
0        1              Rock
1       18   Science Fiction
2       19          TV Shows
3       20  Sci Fi & Fantasy
4       21             Drama
5       22            Comedy

In [163]:
#2.6. Покажите артистов в жанре Classical.
# SQL - SELECT * FROM Artist WHERE Artist.Name = (SELECT Track.Composer FROM Track WHERE Track.Composer = Artist.Name AND Track.GenreId = (SELECT Genre.GenreId FROM Genre WHERE Genre.Name = "Classical"))

sq = select(artist)
sub_query = select(track.c.Composer).where(track.c.Composer == artist.c.Name).where(genre.c.Name == "Classical").scalar_subquery()
s = sq.where(artist.c.Name == sub_query)

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Artist"."ArtistId", "Artist"."Name"
FROM "Artist"
WHERE "Artist"."Name" = (SELECT "Track"."Composer"
FROM "Track", "Genre"
WHERE "Track"."Composer" = "Artist"."Name" AND "Genre"."Name" = :Name_1)
Всего записей, удовлетворяющих условию: 47

    ArtistId                   Name
0          1                  AC/DC
1          7           Apocalyptica
2         10           Billy Cobham
3         12          Black Sabbath
4         14        Bruce Dickinson
5         15              Buddy Guy
6         16         Caetano Veloso
7         17          Chico Buarque
8         19           Cidade Negra
9         24           Marcos Valle
10        27           Gilberto Gil
11        34             Nando Reis
12        42      Milton Nascimento
13        46              Jorge Ben
14        50              Metallica
15        51                  Queen
16        54              Green Day
17        55        David Coverdale
18        56            Gonzaguinha
19        59                Santana
20        68            Miles Davis
21        80                 Djavan
22        81           Eric Clapton
23        82          Faith No More
24        84           Foo Fighters
25        91            James Brown
26        94           Jimi Hendrix
27        97           João Suplicy
28       100          Lenny Kravitz
29       101            Lulu Santos
30       104            Marvin Gaye
31       108        Mônica Marianno
32       110                Nirvana
33       118              Pearl Jam
34       124                 R.E.M.
35       127  Red Hot Chili Peppers
36       132            Soundgarden
37       138              The Clash
38       143          The Tea Party
39       145               Tim Maia
40       146                  Titãs
41       150                     U2
42       152              Van Halen
43       199             Karsh Kale
44       202         Aaron Goldberg
45       205          Chris Cornell
46       240          Gustav Mahler

In [154]:
# 2.7. Найдите артистов, записавших альбомы, в которых более 20 произведений.
# SQL - SELECT Artist.Name, COUNT(Track.AlbumId) FROM Artist INNER JOIN Album on Artist.ArtistId = Album.ArtistId LEFT JOIN Track on Album.AlbumId = Track.AlbumId GROUP BY Album.AlbumId HAVING COUNT(Track.AlbumId) > 20

s = select(artist.c.Name, func.count(track.c.AlbumId).label("Кол-во треков в альбоме")).where(artist.c.ArtistId == album.c.ArtistId).join(album, album.c.AlbumId == track.c.AlbumId, isouter=True).having(func.count(track.c.AlbumId) > 20)
s = s.group_by(album.c.AlbumId)

print(s)
print(f"Всего записей, удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT "Artist"."Name", count("Track"."AlbumId") AS "Кол-во треков в альбоме"
FROM "Artist", "Track" LEFT OUTER JOIN "Album" ON "Album"."AlbumId" = "Track"."AlbumId"
WHERE "Artist"."ArtistId" = "Album"."ArtistId" GROUP BY "Album"."AlbumId"
HAVING count("Track"."AlbumId") > :count_1
Всего записей, удовлетворяющих условию: 17

                              Name  Кол-во треков в альбоме
0                    Chico Buarque                       34
1      Chico Science & Nação Zumbi                       23
2                        Green Day                       21
3                       Gene Krupa                       22
4                     Eric Clapton                       30
5                    Frank Sinatra                       24
6                    Lenny Kravitz                       57
7          Os Paralamas Do Sucesso                       21
8                            Titãs                       22
9                           Heroes                       23
10                            Lost                       26
11                            Lost                       25
12                            Lost                       24
13                      The Office                       22
14                      The Office                       25
15  Battlestar Galactica (Classic)                       24
16                              U2                       23